Revit 2027 API
GroupTypeId.LifeSafety Property
 Life Safety.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LifeSafety { get; }
Public Shared ReadOnly Property LifeSafety As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LifeSafety {
	ForgeTypeId^ get ();
}
static member LifeSafety : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace